0.1.0/tutorials/incompressible/non-newtonian-ico/offset_cylinder/constant/transportProperties
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}

transportModel  CrossPowerLaw;
CrossPowerLawCoeffs
{
  nu0         [0 2 -1 0 0 0 0]  0.01;
  nuInf       [0 2 -1 0 0 0 0]  10;
  m           [0 0 1 0 0 0 0]   0.4;
  n           [0 0 0 0 0 0 0]   3;
}
BirdCarreauCoeffs
{
  nu0         [0 2 -1 0 0 0 0]  1e-06;
  nuInf       [0 2 -1 0 0 0 0]  1e-06;
  k           [0 0 1 0 0 0 0]   0;
  n           [0 0 0 0 0 0 0]   1;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
