0.1.0/tutorials/incompressible/non-newtonian-ico/offset_cylinder/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     non-newtonian-ico;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2;
deltaT          0.0025;
writeControl    runTime;
writeInterval   0.05;
purgeWrite      0;
writeFormat     ascii;
writePrecision  12;
writeCompression on;
timeFormat      general;
timePrecision   12;
runTimeModifiable true;

// vim: set ft=foam et sw=2 ts=2 sts=2:
